In [3]:
import pandas as pd

In [5]:
import os

In [7]:
os.getcwd()

'C:\\Users\\ASUS'

In [9]:
os.chdir('Downloads\\')

In [32]:
import pandas as pd 

data = {
    "Name": ['yash', 'mahesh', 'raj'],
    "age": [24, 32, 28],
    "city": ['amravti', 'nagpur', 'pune']
}

df = pd.DataFrame(data)  # Corrected: pd.DataFrame instead of pd.dataframe
print(df)

df.to_csv("output.csv", index=False)  # Also note: False should be capitalized (not false)

     Name  age     city
0    yash   24  amravti
1  mahesh   32   nagpur
2     raj   28     pune

In [36]:
display(df)

     Name  age     city
0    yash   24  amravti
1  mahesh   32   nagpur
2     raj   28     pune

In [38]:
df.head()

     Name  age     city
0    yash   24  amravti
1  mahesh   32   nagpur
2     raj   28     pune

In [40]:
df.tail()

     Name  age     city
0    yash   24  amravti
1  mahesh   32   nagpur
2     raj   28     pune

In [42]:
df.isnull().sum()

Name    0
age     0
city    0
dtype: int64

In [44]:
df=pd.read_csv("sales_data_sample.csv", encoding="latin1")
print(df.info())

FileNotFoundError: [Errno 2] No such file or directory: 'sales_data_sample.csv'

In [46]:
import pandas as pd

data = {
    "Name": ['yash', 'mahesh', 'raj','vaibhav','ajay','deep','ram','rohit'],
    "age": [24, 32, 28,34,23,27,29,33],
    "Salary": [50000,42000,45000,39000,54000,84000,32000,45000],
    "Perforamance Score":[98,90,87,68,92,84,88,75]
}

df = pd.DataFrame(data)  # Corrected: pd.DataFrame instead of pd.dataframe
print("sample dataframe")
print(df)
print("Descriptive statistics")
print(df.describe())

sample dataframe
      Name  age  Salary  Perforamance Score
0     yash   24   50000                  98
1   mahesh   32   42000                  90
2      raj   28   45000                  87
3  vaibhav   34   39000                  68
4     ajay   23   54000                  92
5     deep   27   84000                  84
6      ram   29   32000                  88
7    rohit   33   45000                  75
Descriptive statistics
             age       Salary  Perforamance Score
count   8.000000      8.00000            8.000000
mean   28.750000  48875.00000           85.250000
std     4.062019  15679.26292            9.602827
min    23.000000  32000.00000           68.000000
25%    26.250000  41250.00000           81.750000
50%    28.500000  45000.00000           87.500000
75%    32.250000  51000.00000           90.500000
max    34.000000  84000.00000           98.000000

In [48]:
print(f'shape:{df.shape}')
print(f'column names:{df.columns}')
print(df)

shape:(8, 4)
column names:Index(['Name', 'age', 'Salary', 'Perforamance Score'], dtype='object')
      Name  age  Salary  Perforamance Score
0     yash   24   50000                  98
1   mahesh   32   42000                  90
2      raj   28   45000                  87
3  vaibhav   34   39000                  68
4     ajay   23   54000                  92
5     deep   27   84000                  84
6      ram   29   32000                  88
7    rohit   33   45000                  75

In [50]:
condition1=df[df["Salary"]>50000]
print(condition1)

   Name  age  Salary  Perforamance Score
4  ajay   23   54000                  92
5  deep   27   84000                  84

In [52]:
condition2=df[(df["Salary"]>50000)&(df["Perforamance Score"]>90)]
print(condition2)

   Name  age  Salary  Perforamance Score
4  ajay   23   54000                  92

In [54]:
print("name (single colume return series)")
print(df["Name"])

name (single colume return series)
0       yash
1     mahesh
2        raj
3    vaibhav
4       ajay
5       deep
6        ram
7      rohit
Name: Name, dtype: object

In [56]:
#selecting multiple columes

subset=df[["Name","Salary"]]
print("\nsubset with name and salary")
print(subset)

subset with name and salary
      Name  Salary
0     yash   50000
1   mahesh   42000
2      raj   45000
3  vaibhav   39000
4     ajay   54000
5     deep   84000
6      ram   32000
7    rohit   45000

In [58]:
filtered=df[(df["Salary"]>40000)&(df["age"]>25)]
print(filtered)

     Name  age  Salary  Perforamance Score
1  mahesh   32   42000                  90
2     raj   28   45000                  87
5    deep   27   84000                  84
7   rohit   33   45000                  75

In [60]:
# using OR condition 

filtered_or=df[(df["Perforamance Score"]>90)| (df["age"]>30)]
print(filtered_or)

      Name  age  Salary  Perforamance Score
0     yash   24   50000                  98
1   mahesh   32   42000                  90
3  vaibhav   34   39000                  68
4     ajay   23   54000                  92
7    rohit   33   45000                  75

In [62]:
df["Bonus"]=df["Salary"]*0.1
print(df)

      Name  age  Salary  Perforamance Score   Bonus
0     yash   24   50000                  98  5000.0
1   mahesh   32   42000                  90  4200.0
2      raj   28   45000                  87  4500.0
3  vaibhav   34   39000                  68  3900.0
4     ajay   23   54000                  92  5400.0
5     deep   27   84000                  84  8400.0
6      ram   29   32000                  88  3200.0
7    rohit   33   45000                  75  4500.0

In [64]:
df.insert(0,"Employee_id",[10,20,30,40,50,60,70,80])
print(df)

   Employee_id     Name  age  Salary  Perforamance Score   Bonus
0           10     yash   24   50000                  98  5000.0
1           20   mahesh   32   42000                  90  4200.0
2           30      raj   28   45000                  87  4500.0
3           40  vaibhav   34   39000                  68  3900.0
4           50     ajay   23   54000                  92  5400.0
5           60     deep   27   84000                  84  8400.0
6           70      ram   29   32000                  88  3200.0
7           80    rohit   33   45000                  75  4500.0

In [66]:
df.loc[4,"Salary"]=60000
print(df)

   Employee_id     Name  age  Salary  Perforamance Score   Bonus
0           10     yash   24   50000                  98  5000.0
1           20   mahesh   32   42000                  90  4200.0
2           30      raj   28   45000                  87  4500.0
3           40  vaibhav   34   39000                  68  3900.0
4           50     ajay   23   60000                  92  5400.0
5           60     deep   27   84000                  84  8400.0
6           70      ram   29   32000                  88  3200.0
7           80    rohit   33   45000                  75  4500.0

In [68]:
df["Salary"]=df["Salary"]*1.05
print(df)

   Employee_id     Name  age   Salary  Perforamance Score   Bonus
0           10     yash   24  52500.0                  98  5000.0
1           20   mahesh   32  44100.0                  90  4200.0
2           30      raj   28  47250.0                  87  4500.0
3           40  vaibhav   34  40950.0                  68  3900.0
4           50     ajay   23  63000.0                  92  5400.0
5           60     deep   27  88200.0                  84  8400.0
6           70      ram   29  33600.0                  88  3200.0
7           80    rohit   33  47250.0                  75  4500.0

In [17]:
df.drop(Columns=[" Perforamance Score"],inplace=True)
print(df)

NameError: name 'df' is not defined

In [72]:
import pandas as pd

data = {
    "Name": ['yash', 'mahesh', 'raj','vaibhav','ajay','deep','ram','rohit'],
    "age": [24, 32, None,34,23,27,29,33],
    "Salary": [50000,42000,45000,None,54000,None,32000,45000],
    "Perforamance Score":[98,90,None,68,92,84,88,75]
}

df = pd.DataFrame(data)  # Corrected: pd.DataFrame instead of pd.dataframe
print("sample dataframe")
print(df)

sample dataframe
      Name   age   Salary  Perforamance Score
0     yash  24.0  50000.0                98.0
1   mahesh  32.0  42000.0                90.0
2      raj   NaN  45000.0                 NaN
3  vaibhav  34.0      NaN                68.0
4     ajay  23.0  54000.0                92.0
5     deep  27.0      NaN                84.0
6      ram  29.0  32000.0                88.0
7    rohit  33.0  45000.0                75.0

In [74]:
print(df.isnull())

print(df.isnull().sum())

    Name    age  Salary  Perforamance Score
0  False  False   False               False
1  False  False   False               False
2  False   True   False                True
3  False  False    True               False
4  False  False   False               False
5  False  False    True               False
6  False  False   False               False
7  False  False   False               False
Name                  0
age                   1
Salary                2
Perforamance Score    1
dtype: int64

In [76]:
# for removing missing values 

df.dropna(axis=0,inplace=True)
print(df)

     Name   age   Salary  Perforamance Score
0    yash  24.0  50000.0                98.0
1  mahesh  32.0  42000.0                90.0
4    ajay  23.0  54000.0                92.0
6     ram  29.0  32000.0                88.0
7   rohit  33.0  45000.0                75.0

In [78]:
import pandas as pd

data = {
    "Name": ['yash', 'mahesh', 'raj','vaibhav','ajay','deep','ram','rohit'],
    "age": [24, 32, None,34,23,27,29,33],
    "Salary": [50000,42000,45000,None,54000,None,32000,45000],
    "Perforamance Score":[98,90,None,68,92,84,88,75]
}

df = pd.DataFrame(data)  # Corrected: pd.DataFrame instead of pd.dataframe
print("sample dataframe")
print(df)

sample dataframe
      Name   age   Salary  Perforamance Score
0     yash  24.0  50000.0                98.0
1   mahesh  32.0  42000.0                90.0
2      raj   NaN  45000.0                 NaN
3  vaibhav  34.0      NaN                68.0
4     ajay  23.0  54000.0                92.0
5     deep  27.0      NaN                84.0
6      ram  29.0  32000.0                88.0
7    rohit  33.0  45000.0                75.0

In [80]:
#filling values in missing values

df.fillna(0,inplace=True)
print(df)

      Name   age   Salary  Perforamance Score
0     yash  24.0  50000.0                98.0
1   mahesh  32.0  42000.0                90.0
2      raj   0.0  45000.0                 0.0
3  vaibhav  34.0      0.0                68.0
4     ajay  23.0  54000.0                92.0
5     deep  27.0      0.0                84.0
6      ram  29.0  32000.0                88.0
7    rohit  33.0  45000.0                75.0

In [82]:
import pandas as pd

data = {
    "Name": ['yash', 'mahesh', 'raj','vaibhav','ajay','deep','ram','rohit'],
    "age": [24, 32, None,34,23,27,29,33],
    "Salary": [50000,42000,45000,None,54000,None,32000,45000],
    "Perforamance Score":[98,90,None,68,92,84,88,75]
}

df = pd.DataFrame(data)  # Corrected: pd.DataFrame instead of pd.dataframe
print("sample dataframe")
print(df)

sample dataframe
      Name   age   Salary  Perforamance Score
0     yash  24.0  50000.0                98.0
1   mahesh  32.0  42000.0                90.0
2      raj   NaN  45000.0                 NaN
3  vaibhav  34.0      NaN                68.0
4     ajay  23.0  54000.0                92.0
5     deep  27.0      NaN                84.0
6      ram  29.0  32000.0                88.0
7    rohit  33.0  45000.0                75.0

In [84]:
# another way to filling value

df["age"].fillna(df["age"].mean(),inplace=True)
print(df)

      Name        age   Salary  Perforamance Score
0     yash  24.000000  50000.0                98.0
1   mahesh  32.000000  42000.0                90.0
2      raj  28.857143  45000.0                 NaN
3  vaibhav  34.000000      NaN                68.0
4     ajay  23.000000  54000.0                92.0
5     deep  27.000000      NaN                84.0
6      ram  29.000000  32000.0                88.0
7    rohit  33.000000  45000.0                75.0

C:\Users\ASUS\AppData\Local\Temp\ipykernel_5356\412227497.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["age"].fillna(df["age"].mean(),inplace=True)

In [86]:
df["Salary"].fillna(df["Salary"].mean(),inplace=True)
print(df)

      Name        age        Salary  Perforamance Score
0     yash  24.000000  50000.000000                98.0
1   mahesh  32.000000  42000.000000                90.0
2      raj  28.857143  45000.000000                 NaN
3  vaibhav  34.000000  44666.666667                68.0
4     ajay  23.000000  54000.000000                92.0
5     deep  27.000000  44666.666667                84.0
6      ram  29.000000  32000.000000                88.0
7    rohit  33.000000  45000.000000                75.0

C:\Users\ASUS\AppData\Local\Temp\ipykernel_5356\763457068.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Salary"].fillna(df["Salary"].mean(),inplace=True)

In [88]:
df["Perforamance Score"].fillna(df["Perforamance Score"].mean(),inplace=True)
print(df)

      Name        age        Salary  Perforamance Score
0     yash  24.000000  50000.000000                98.0
1   mahesh  32.000000  42000.000000                90.0
2      raj  28.857143  45000.000000                85.0
3  vaibhav  34.000000  44666.666667                68.0
4     ajay  23.000000  54000.000000                92.0
5     deep  27.000000  44666.666667                84.0
6      ram  29.000000  32000.000000                88.0
7    rohit  33.000000  45000.000000                75.0

C:\Users\ASUS\AppData\Local\Temp\ipykernel_5356\1616446553.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Perforamance Score"].fillna(df["Perforamance Score"].mean(),inplace=True)

In [90]:
#filling estimatesd values
#linear, polynomial


import pandas as pd

data={
    "Time":[1,2,3,4,5],
    "values":[10,None,30,None,50]
}
df=pd.DataFrame(data)
print("Before interpolation")
print(df)
df["values"]=df["values"].interpolate(method="linear")
print("After interpolation")
print(df)

Before interpolation
   Time  values
0     1    10.0
1     2     NaN
2     3    30.0
3     4     NaN
4     5    50.0
After interpolation
   Time  values
0     1    10.0
1     2    20.0
2     3    30.0
3     4    40.0
4     5    50.0

In [92]:
#Sorting and aggregation

import pandas as pd
data={
    "Name": ['yash', 'mahesh', 'raj','vaibhav'],
    "age": [24, 32,34,23],
    "Salary": [50000,42000,45000,36000]
}
df=pd.DataFrame(data)
df.sort_values(by='age',ascending=False,inplace=True)
print('Sorted age by descending')
print(df)

Sorted age by descending
      Name  age  Salary
2      raj   34   45000
1   mahesh   32   42000
0     yash   24   50000
3  vaibhav   23   36000

In [94]:
df.sort_values(by=['age','Salary'], ascending=[True,False],inplace=True)
print(df)

      Name  age  Salary
3  vaibhav   23   36000
0     yash   24   50000
1   mahesh   32   42000
2      raj   34   45000

In [96]:
#summary statistic
#.mean()  .sum()  .max()  .min()  
import pandas as pd
data={
    "Name": ['yash', 'mahesh', 'raj','vaibhav'],
    "age": [24, 32,34,23],
    "Salary": [50000,42000,45000,36000]
}
df=pd.DataFrame(data)
print(df)
avg_salary=df['Salary'].mean()
print("avg Salary is: ",avg_salary)

      Name  age  Salary
0     yash   24   50000
1   mahesh   32   42000
2      raj   34   45000
3  vaibhav   23   36000
avg Salary is:  43250.0

In [98]:
sum=df["Salary"].sum()
print("salary of all emp is: ",sum)

salary of all emp is:  173000

In [100]:
import pandas as pd
data={
    "Name": ['yash', 'mahesh', 'raj','vaibhav'],
    "age": [24, 32,24,23],
    "Salary": [50000,42000,45000,36000]
}
df=pd.DataFrame(data)
print(df)

      Name  age  Salary
0     yash   24   50000
1   mahesh   32   42000
2      raj   24   45000
3  vaibhav   23   36000

In [102]:
#grouping

grouped=df.groupby('age')["Salary"].sum()
print(grouped)

age
23    36000
24    95000
32    42000
Name: Salary, dtype: int64

In [104]:
grouped=df.groupby(['age','Name'])["Salary"].sum()
print(grouped)

age  Name
23   vaibhav    36000
24   raj        45000
     yash       50000
32   mahesh     42000
Name: Salary, dtype: int64

In [106]:
#merging and joining

import pandas as pd
data1=pd.DataFrame({
    "customerID":[1,2,3,4],
    "Name":['yash','ajay','vaibhav','mahesh']
})

data2=pd.DataFrame({
    "customerID":[1,2,3,5],
    "amount":[345,654,234,765]
})

df_merged=pd.merge(data1,data2,on="customerID",how='inner')
print('inner join')
print(df_merged)

inner join
   customerID     Name  amount
0           1     yash     345
1           2     ajay     654
2           3  vaibhav     234

In [108]:
df_merged=pd.merge(data1,data2,on="customerID",how='outer')
print('outer join')
print(df_merged)

outer join
   customerID     Name  amount
0           1     yash   345.0
1           2     ajay   654.0
2           3  vaibhav   234.0
3           4   mahesh     NaN
4           5      NaN   765.0

In [110]:
df_merged=pd.merge(data1,data2,on="customerID",how='right')
print('right join')
print(df_merged)

right join
   customerID     Name  amount
0           1     yash     345
1           2     ajay     654
2           3  vaibhav     234
3           5      NaN     765

In [112]:
df_merged=pd.merge(data1,data2,on="customerID",how='left')
print('left join')
print(df_merged)

left join
   customerID     Name  amount
0           1     yash   345.0
1           2     ajay   654.0
2           3  vaibhav   234.0
3           4   mahesh     NaN

In [114]:
#concatenation

import pandas as pd
region1=pd.DataFrame({
    "customerID":[1,2,3,4],
    "Name":['yash','ajay','vaibhav','mahesh']
})

region2=pd.DataFrame({
    "customerID":[5,6,7],
    "Name":['ram','adity','pawan']
})

df_concat=pd.concat([region1,region2],ignore_index=True)
print(df_concat)

   customerID     Name
0           1     yash
1           2     ajay
2           3  vaibhav
3           4   mahesh
4           5      ram
5           6    adity
6           7    pawan

In [116]:
df_concat=pd.concat([region1,region2],axis=1,ignore_index=True)
print(df_concat)

   0        1    2      3
0  1     yash  5.0    ram
1  2     ajay  6.0  adity
2  3  vaibhav  7.0  pawan
3  4   mahesh  NaN    NaN